In [1]:
import pandas as pd
import numpy as np

# Merge

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [2]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'first': range(7)})

In [3]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'second': range(3)})

In [4]:
df1

  key  first
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2

  key  second
0   a       0
1   b       1
2   d       2

In [6]:
pd.merge(df1,df2, on ='key', how = 'inner')

  key  first  second
0   b      0       1
1   b      1       1
2   b      6       1
3   a      2       0
4   a      4       0
5   a      5       0

In [7]:
pd.merge(df1,df2, on ='key', how = 'outer')

  key  first  second
0   b    0.0     1.0
1   b    1.0     1.0
2   b    6.0     1.0
3   a    2.0     0.0
4   a    4.0     0.0
5   a    5.0     0.0
6   c    3.0     NaN
7   d    NaN     2.0

In [8]:
pd.merge(df1,df2, on ='key',how= 'left')

  key  first  second
0   b      0     1.0
1   b      1     1.0
2   a      2     0.0
3   c      3     NaN
4   a      4     0.0
5   a      5     0.0
6   b      6     1.0

In [9]:
pd.merge(df1,df2, on ='key',how= 'right')

  key  first  second
0   a    2.0       0
1   a    4.0       0
2   a    5.0       0
3   b    0.0       1
4   b    1.0       1
5   b    6.0       1
6   d    NaN       2

# Concat

In [10]:
arrays1 = [
    np.array(["A0", "A1",  "A2", "A3"]),
    np.array(["B0", "B1",  "B2", "B3"]),
    np.array(["C0", "C1",  "C2", "C3"]),
    np.array(["D0", "D1",  "D2", "D3"])
]

dfconc1 = pd.DataFrame(arrays1, index = np.array([1,2,3,4])).T
dfconc1.columns = ["A","B","C","D"]
dfconc1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
arrays2 = [
    np.array(["B2", "B3",  "B6", "B7"]),
    np.array(["D2", "D3",  "D6", "D4"]),
    np.array(["F2", "F3",  "F6", "F4"])
]

dfconc2 = pd.DataFrame(arrays2).T
dfconc2.columns = ["B","D","F"]
dfconc2.index = [2,3,6,7]
dfconc2

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D4  F4

In [12]:
pd.concat([dfconc1, dfconc2], axis = 0)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D4   F4

In [13]:
pd.concat([dfconc1,dfconc2], axis = 1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D4   F4

# DropDuplicates

In [14]:
df1

  key  first
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [15]:
df1.duplicated("key")

0    False
1     True
2    False
3    False
4     True
5     True
6     True
dtype: bool

In [16]:
df1.drop_duplicates("key")

  key  first
0   b      0
2   a      2
3   c      3

In [17]:
df1.drop_duplicates("key", keep = "last")

  key  first
3   c      3
5   a      5
6   b      6

In [18]:
df1.drop_duplicates("key", keep = False)

  key  first
3   c      3

In [19]:
df1.groupby("key", as_index = False).mean()

  key     first
0   a  3.666667
1   b  2.333333
2   c  3.000000

# Índices hierárquicos

In [20]:
arrays = [
    np.array(["a", "a",  "b", "b",  "c", "c","d","d"]),
    np.array([1, 2, 1, 2, 1, 2, 1, 2]),
]
s = pd.Series(np.random.randn(8), index=arrays)
df = pd.DataFrame(np.random.randn(8, 4), index=arrays)
df

            0         1         2         3
a 1  1.217418  0.306799  1.257179 -0.504035
  2 -1.013170  0.816378 -0.792948  0.170767
b 1 -0.727238  0.915739 -0.688060  0.038071
  2  2.593162 -1.330985 -0.212156 -0.746912
c 1 -0.896988  1.440683 -1.232360 -1.321118
  2  1.687356 -2.402990  1.381141  0.712219
d 1 -2.358465 -1.553485 -0.433264  0.152508
  2 -0.115346 -1.591578  0.566530  0.954752

In [21]:
df.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2),
            ('d', 1),
            ('d', 2)],
           )

In [22]:
df.loc[(["a","b"])]

            0         1         2         3
a 1  1.217418  0.306799  1.257179 -0.504035
  2 -1.013170  0.816378 -0.792948  0.170767
b 1 -0.727238  0.915739 -0.688060  0.038071
  2  2.593162 -1.330985 -0.212156 -0.746912

In [23]:
df.loc[(["a","b"],2),:]

            0         1         2         3
a 2 -1.013170  0.816378 -0.792948  0.170767
b 2  2.593162 -1.330985 -0.212156 -0.746912

In [24]:
df.loc[("b",2)]

0    2.593162
1   -1.330985
2   -0.212156
3   -0.746912
Name: (b, 2), dtype: float64

In [25]:
df.loc[("b",2),0]

2.593161723091665

In [26]:
df.unstack()

          0                   1                   2                   3  \
          1         2         1         2         1         2         1
a  1.217418 -1.013170  0.306799  0.816378  1.257179 -0.792948 -0.504035
b -0.727238  2.593162  0.915739 -1.330985 -0.688060 -0.212156  0.038071
c -0.896988  1.687356  1.440683 -2.402990 -1.232360  1.381141 -1.321118
d -2.358465 -0.115346 -1.553485 -1.591578 -0.433264  0.566530  0.152508


          2
a  0.170767
b -0.746912
c  0.712219
d  0.954752

In [27]:
df.sum(level = 1)

C:\Users\gusta\AppData\Local\Temp\ipykernel_18388\1551480555.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.sum(level = 1)

          0         1         2         3
1 -2.765273  1.109737 -1.096505 -1.634574
2  3.152002 -4.509174  0.942567  1.090826

In [28]:
df.sum(level = 0)

C:\Users\gusta\AppData\Local\Temp\ipykernel_18388\1193966005.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.sum(level = 0)

          0         1         2         3
a  0.204248  1.123177  0.464230 -0.333268
b  1.865924 -0.415245 -0.900216 -0.708841
c  0.790368 -0.962306  0.148782 -0.608899
d -2.473811 -3.145063  0.133266  1.107260

#GroupBy

In [29]:
df1

  key  first
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [30]:
df1.groupby(["key"]).count()

     first
key
a        3
b        3
c        1

In [31]:
df1.groupby(["key"]).mean()

        first
key
a    3.666667
b    2.333333
c    3.000000

In [32]:
df1.groupby(["key"])["first"].agg(["sum","mean"])

     sum      mean
key
a     11  3.666667
b      7  2.333333
c      3  3.000000

In [33]:
p25 = lambda x: x.quantile(0.25)
df1.groupby(["key"])["first"].agg(p25)

key
a    3.0
b    0.5
c    3.0
Name: first, dtype: float64

#Pivot

In [34]:
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'],
      'B': ['Masters', 'Graduate', 'Graduate'],
      'C': [27, 23, 21]})

In [35]:
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [36]:
df.pivot(columns='B')

         A                C
B Graduate Masters Graduate Masters
0      NaN    John      NaN    27.0
1     Boby     NaN     23.0     NaN
2     Mina     NaN     21.0     NaN

In [37]:
df.pivot(index ='A', columns ='B', values =['C'])

            C
B    Graduate Masters
A
Boby     23.0     NaN
John      NaN    27.0
Mina     21.0     NaN

In [38]:
df.pivot(index ='A', columns ='B', values =['C', 'A'])

            C                A
B    Graduate Masters Graduate Masters
A
Boby       23     NaN     Boby     NaN
John      NaN      27      NaN    John
Mina       21     NaN     Mina     NaN